[role=enterprise-edition]
[[tutorial-cc-backup-restore-db]]
= Back up and restore a database in Causal Cluster
:description: This tutorial provides a detailed example of how to back up and restore a database in a running Causal Cluster. 

The following example assumes that your database has users and roles associated with it and describes how to back it up and then restore it in a running Causal Cluster.
For more information on how to set up a Causal Cluster, see xref:tutorial/local-causal-cluster.adoc[Set up a local Causal Cluster].

[NOTE]
In a Neo4j DBMS, every database is backed up individually.
Therefore, it is very important to plan your backup strategy for each of them.
For more detailed information on how to design an appropriate backup strategy for your setup, see xref:backup-restore/index.adoc[Backup and restore].

[[tutorial-prepare-to-backup]]
== Prepare to back up your database

Before you perform the backup, it is good to take a note of the data and metadata of the database that you want to restore.
You can use this information to later verify that the restore is successful and to recreate the database users and roles.
In this example, the database is called `movies1` and uses the Movie Graph dataset from the Neo4j Browser -> Favorites -> Example Graphs.

[NOTE]
====
This tutorial uses the Linux or macOS tarball installation.
It assumes that your current work directory is the _<neo4j-home>_ directory of the tarball installation.
====

. In the Neo4j instance, where the database is running, log in to the Cypher Shell command-line console with your credentials.
For more information about the Cypher Shell command-line interface (CLI) and how to use it, see xref:tools/cypher-shell.adoc[Cypher Shell].
+
[source, shell, role=noplay]
----
bin/cypher-shell -u neo4j -p <password>
----
+
[queryresult]
----
Connected to Neo4j at neo4j://localhost:7687 as user neo4j.
Type :help for a list of available commands or :exit to exit the shell.
Note that Cypher queries must end with a semicolon.
----
+
. Change the active database to `movies1`.
+
[source, cypher, role=noplay]
----
:use movies1
----

. Run a query to count the number of nodes in the database.
+
[source, cypher, role=noplay]
----
MATCH (n) RETURN count(n) AS countNode;
----
+
[queryresult]
----
+-----------+
| countNode |
+-----------+
| 171       |
+-----------+

1 row available after 22 ms, consumed after another 1 ms
----
+
. Run a query to count the number of relationships.
+
[source, cypher, role=noplay]
----
MATCH (n)-[r]->() RETURN count(r) AS countRelationships;
----
+
[queryresult]
----
+--------------------+
| countRelationships |
+--------------------+
| 253                |
+--------------------+

1 row available after 29 ms, consumed after another 0 ms
----
+
. Change the active database to `system`, and run a query to see if there are any custom roles, associated with this database, and their privileges.
+
[source, cypher, role=noplay]
----
SHOW ALL PRIVILEGES;
----
+
[queryresult]
----
+-------------------------------------------------------------------------------------------+
| access    | action       | resource         | graph     | segment           | role        |
+-------------------------------------------------------------------------------------------+
| "GRANTED" | "access"     | "database"       | "DEFAULT" | "database"        | "PUBLIC"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "admin"     |
| "GRANTED" | "write"      | "graph"          | "*"       | "NODE(*)"         | "admin"     |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "admin"     |
| "GRANTED" | "write"      | "graph"          | "*"       | "RELATIONSHIP(*)" | "admin"     |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "admin"     |
| "GRANTED" | "admin"      | "database"       | "*"       | "database"        | "admin"     |
| "GRANTED" | "constraint" | "database"       | "*"       | "database"        | "admin"     |
| "GRANTED" | "index"      | "database"       | "*"       | "database"        | "admin"     |
| "GRANTED" | "token"      | "database"       | "*"       | "database"        | "admin"     |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "architect" |
| "GRANTED" | "write"      | "graph"          | "*"       | "NODE(*)"         | "architect" |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "architect" |
| "GRANTED" | "write"      | "graph"          | "*"       | "RELATIONSHIP(*)" | "architect" |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "architect" |
| "GRANTED" | "constraint" | "database"       | "*"       | "database"        | "architect" |
| "GRANTED" | "index"      | "database"       | "*"       | "database"        | "architect" |
| "GRANTED" | "token"      | "database"       | "*"       | "database"        | "architect" |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "editor"    |
| "GRANTED" | "write"      | "graph"          | "*"       | "NODE(*)"         | "editor"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "editor"    |
| "GRANTED" | "write"      | "graph"          | "*"       | "RELATIONSHIP(*)" | "editor"    |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "editor"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "myrole"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "myrole"    |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "myrole"    |
| "GRANTED" | "write"      | "graph"          | "movies1" | "NODE(*)"         | "myrole"    |
| "GRANTED" | "write"      | "graph"          | "movies1" | "RELATIONSHIP(*)" | "myrole"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "publisher" |
| "GRANTED" | "write"      | "graph"          | "*"       | "NODE(*)"         | "publisher" |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "publisher" |
| "GRANTED" | "write"      | "graph"          | "*"       | "RELATIONSHIP(*)" | "publisher" |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "publisher" |
| "GRANTED" | "token"      | "database"       | "*"       | "database"        | "publisher" |
| "GRANTED" | "match"      | "all_properties" | "*"       | "NODE(*)"         | "reader"    |
| "GRANTED" | "match"      | "all_properties" | "*"       | "RELATIONSHIP(*)" | "reader"    |
| "GRANTED" | "access"     | "database"       | "*"       | "database"        | "reader"    |
+-------------------------------------------------------------------------------------------+

37 rows available after 291 ms, consumed after another 53 ms
----
The result shows that there is one custom role `myrole`.
+
. Run a query to see all users associated with this role.
+
[source, cypher, role=noplay]
----
SHOW USERS;
----
+
[queryresult]
----
+---------------------------------------------------------------------+
| user    | roles                | passwordChangeRequired | suspended |
+---------------------------------------------------------------------+
| "neo4j" | ["admin", "PUBLIC"]  | FALSE                  | FALSE     |
| "user1" | ["myrole", "PUBLIC"] | TRUE                   | FALSE     |
+---------------------------------------------------------------------+

2 rows available after 36 ms, consumed after another 2 ms
----
. Exit the Cypher Shell command-line console.
+
[source, shell, role=noplay]
----
:exit
----

[[tutorial-backup-database]]
== Back up your database

Now you are ready to back up the database.

Run the following command to back up the database in your targeted folder.
If the folder where you want to place your backup does not exist, you have to create it.
In this example, it is called _/tmp/{neo4j-version-exact}_.

[source, shell, subs=attributes, role=noplay]
----
bin/neo4j-admin backup --backup-dir=/tmp/{neo4j-version-exact} --database=movies1
----

For details on performing a backup and the different command options, see xref:backup-restore/online-backup.adoc[Back up an online database].

[[tutorial-drop-database]]
== Delete the database that you want to replace

Before you restore the database backup, you have to delete the database that you want to replace with that backup.
If you want to restore the backup as an _additional_ database in your DBMS, then you can proceed to xref:tutorial/causal-backup-restore-db.adoc#tutorial-restore-database[Restore the database backup on all cluster members] directly.

On one of the cluster members, run the Cypher command `DROP DATABASE` to delete the database that you want to replace.
The command is automatically routed to the leader and from there to the other cluster members.

[WARNING]
====
Dropping a database also deletes the users and roles associated with it.
====

. In the Cypher Shell command-line console on one of the cluster members, change the active database to `system`, and run the command `DROP DATABASE` to delete the database that you want to replace.
In this example, the database is called `movies`.
+
[source, cypher, role=noplay]
----
DROP DATABASE movies;
----
+
[queryresult]
----
0 rows available after 82 ms, consumed after another 0 ms
----
+
[WARNING]
====
If you are unable to delete the database (e.g., because Neo4j is not running), you must run `neo4j-admin unbind` first instead.
If you fail to do this, the store files you have (post restore) will be out of sync with the cluster state you have for that database, leading to logical corruption.
====
+
. You can run `SHOW DATABASES` to verify that the database `movies` does not exist.
+
[source, cypher, role=noplay]
----
SHOW DATABASES;
----
+
[queryresult]
----
+----------------------------------------------------------------------------------------------+
| name     | address          | role       | requestedStatus | currentStatus | error | default |
+----------------------------------------------------------------------------------------------+
| "neo4j"  | "localhost:7687" | "follower" | "online"        | "online"      | ""    | TRUE    |
| "neo4j"  | "localhost:7688" | "leader"   | "online"        | "online"      | ""    | TRUE    |
| "neo4j"  | "localhost:7689" | "follower" | "online"        | "online"      | ""    | TRUE    |
| "system" | "localhost:7687" | "follower" | "online"        | "online"      | ""    | FALSE   |
| "system" | "localhost:7688" | "follower" | "online"        | "online"      | ""    | FALSE   |
| "system" | "localhost:7689" | "leader"   | "online"        | "online"      | ""    | FALSE   |
+----------------------------------------------------------------------------------------------+

6 rows available after 7 ms, consumed after another 3 ms
----

[[tutorial-restore-database]]
== Restore the database backup on all cluster members

On each cluster member, run the following command to restore the database backup.
For details on performing a restore and the different command options, see xref:backup-restore/restore-backup.adoc[Restore a database backup].

[source, shell, subs=attributes, role=noplay]
----
bin/neo4j-admin restore --from=/tmp/{neo4j-version-exact}/movies1 --database=movies1
----

Then, on each cluster member, run the following command to verify that the database `movies1` exists:

[source, shell, role=noplay]
----
ls -al data/databases
----

[queryresult]
----
total 0
drwxr-xr-x@  7 username  staff   224 17 Nov 15:50 .
drwxr-xr-x@  8 username  staff   256 17 Nov 15:50 ..
drwxr-xr-x  40 username  staff  1280 17 Nov 15:50 movies1
drwxr-xr-x  37 username  staff  1184 16 Nov 15:00 neo4j
-rw-r--r--   1 username  staff     0 16 Nov 15:00 store_lock
drwxr-xr-x  38 username  staff  1216 16 Nov 15:00 system
----

However, restoring a database does not automatically create it.
Therefore, it will not be visible if you do `SHOW DATABASES` in Cypher Shell or Neo4j Browser.

[[tutorial-create-database]]
== Create the database backup on the cluster leader

You create the database backup *only on one of your cluster members* using the command `CREATE DATABASE`.
The command is automatically routed to the leader and from there to the other cluster members.

. In the Cypher Shell command-line console on one of the cluster members, use the `system` database and create the database `movies1`.
+
[source, cypher, role=noplay]
----
CREATE DATABASE movies1;
----
+
[queryresult]
----
0 rows available after 132 ms, consumed after another 0 ms
----
+
. Verify that the `movies1` database is online on all members.
+
[source, cypher, role=noplay]
----
SHOW DATABASES;
----
+
[queryresult]
----
+-----------------------------------------------------------------------------------------------+
| name      | address          | role       | requestedStatus | currentStatus | error | default |
+-----------------------------------------------------------------------------------------------+
| "movies1" | "localhost:7688" | "follower" | "online"        | "online"      | ""    | FALSE   |
| "movies1" | "localhost:7687" | "leader"   | "online"        | "online"      | ""    | FALSE   |
| "movies1" | "localhost:7689" | "follower" | "online"        | "online"      | ""    | FALSE   |
| "neo4j"   | "localhost:7688" | "leader"   | "online"        | "online"      | ""    | TRUE    |
| "neo4j"   | "localhost:7687" | "follower" | "online"        | "online"      | ""    | TRUE    |
| "neo4j"   | "localhost:7689" | "follower" | "online"        | "online"      | ""    | TRUE    |
| "system"  | "localhost:7688" | "follower" | "online"        | "online"      | ""    | FALSE   |
| "system"  | "localhost:7687" | "leader"   | "online"        | "online"      | ""    | FALSE   |
| "system"  | "localhost:7689" | "follower" | "online"        | "online"      | ""    | FALSE   |
+-----------------------------------------------------------------------------------------------+

9 rows available after 3 ms, consumed after another 1 ms
----
+
. Change your active database to `movies1` and verify the all the data has been successfully restored by completing the steps 1, 2, and 3 of the section xref:tutorial/causal-backup-restore-db.adoc#tutorial-prepare-to-backup[Prepare to back up your database].

[[tutorial-recreate-roles-privileges]]
== Recreate the database users and roles

On all cluster members, manually recreate all users and roles of the restored database using your notes from steps 4 and 5 of the section xref:tutorial/causal-backup-restore-db.adoc#tutorial-prepare-to-backup[Prepare to back up your database] and the  link:{neo4j-docs-base-uri}/cypher-manual/{page-version}/administration/security[Cypher Manual -> Cypher administration commands].

.Run the following commands against the `system` database to recreate the `movies1` database's custom users, roles, and privileges.
====
. Create the user `user1`.
+
[source, cypher, role=noplay]
----
neo4j@system> CREATE USER user1 IF NOT EXISTS
      SET PASSWORD 'password'
      SET STATUS ACTIVE;
----
+
. Create the role `myrole` as a copy of the built-in role `reader`.
You can see from the notes that `myrole` is a superset of `reader`.
For more information on the Neo4j built-in roles, see xref:authentication-authorization/built-in-roles.adoc[Built-in roles].
+
[source, cypher, role=noplay]
----
CREATE  ROLE myrole  AS COPY OF reader;
----
+
. Grant `myrole` the privilege to write on the graph `movies1`.
+
[source, cypher, role=noplay]
----
GRANT WRITE ON GRAPH movies1 TO myrole;
----
. Grant the role `myrole` to the user `user1`.
+
[source, cypher, role=noplay]
----
GRANT ROLE myrole TO user1;
----
+
. Verify that the role `myrole` has the same privileges as in the database backup.
+
[source, cypher, role=noplay]
----
SHOW ROLE myrole PRIVILEGES;
----
+
[queryresult]
----
+------------------------------------------------------------------------------------+
| access    | action   | resource         | graph     | segment           | role     |
+------------------------------------------------------------------------------------+
| "GRANTED" | "match"  | "all_properties" | "*"       | "NODE(*)"         | "myrole" |
| "GRANTED" | "match"  | "all_properties" | "*"       | "RELATIONSHIP(*)" | "myrole" |
| "GRANTED" | "access" | "database"       | "*"       | "database"        | "myrole" |
| "GRANTED" | "write"  | "graph"          | "movies1" | "NODE(*)"         | "myrole" |
| "GRANTED" | "write"  | "graph"          | "movies1" | "RELATIONSHIP(*)" | "myrole" |
+------------------------------------------------------------------------------------+

5 rows available after 176 ms, consumed after another 1 ms
----
+
. Verify that the user `user1` has the same roles as in the database backup.
+
[source, cypher, role=noplay]
----
SHOW USERS;
----
+
[queryresult]
----
+---------------------------------------------------------------------+
| user    | roles                | passwordChangeRequired | suspended |
+---------------------------------------------------------------------+
| "neo4j" | ["admin", "PUBLIC"]  | FALSE                  | FALSE     |
| "user1" | ["myrole", "PUBLIC"] | TRUE                   | FALSE     |
+---------------------------------------------------------------------+

2 rows available after 43 ms, consumed after another 1 ms
----

====
