[role=enterprise-edition]
[[logging]]
= Logging
:description: This section describes the logging mechanisms in Neo4j, including general log files, error messages, and severity levels. 

[role=enterprise-edition]
[[general-logging]]
== Log files

Neo4j provides logs for monitoring purposes.
The root directory where the general log files are located is configured by xref:reference/configuration-settings.adoc#config_dbms.directories.logs[`dbms.directories.logs`].
For more information on where files are located, see xref:configuration/file-locations.adoc[File locations].

The following table describes the Neo4j general log files and the information they contain.

.Neo4j logs for monitoring
[cols="2", options="header"]
|===
| Filename
| Description

| _neo4j.log_
a|
The _user log_, where general information about Neo4j is written.
Not written for Debian and RPM packages.

| _debug.log_
| The _debug log_, log information useful when debugging problems with Neo4j.

| _http.log_
| The _HTTP log_, log for the HTTP API.

| _gc.log_
| The _garbage collection log_, logging provided by the JVM.

| _query.log_
| The _query log_, log of executed queries that takes longer than a specified threshold. label:Enterprise[]

| _security.log_
| The _security log_, log of security events. label:Enterprise[]

| _service-error.log_
| The _windows service log_, log of errors encountered when installing or running the Windows service. label:Windows[]
|===

.Log paths
[cols="3", options="header"]
|===
| Configuration setting
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.directories.logs[`dbms.directories.logs`]
| `logs`
| Path of the logs directory.

| xref:reference/configuration-settings.adoc#config_dbms.logs.user.path[`dbms.logs.user.path`]
| `neo4j.log`
| Path to the _user log_ file.

| xref:reference/configuration-settings.adoc#config_dbms.logs.debug.path[`dbms.logs.debug.path`]
| `debug.log`
| Path to the _debug log_ file.

| xref:reference/configuration-settings.adoc#config_dbms.logs.http.path[`dbms.logs.http.path`]
| `http.log`
| Path to _HTTP log_ file.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.path[`dbms.logs.query.path`]
| `query.log`
| Path to the _query log_ file.

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.path[`dbms.logs.security.path`]
| `security.log`
| Path to the _security log_ file.
|===


[[general-logging-log-format]]
== Log format

Neo4j {neo4j-version} does not have any configuration for the log format.


[[user-log-file-configuration]]
== User log

._User log_ configurations
[cols="3", options="header"]
|===
| The _user log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.user.rotation.delay[`dbms.logs.user.rotation.delay`]
| `5m`
| The minimum time interval after last rotation of the _user log_, before it may be rotated again.

| xref:reference/configuration-settings.adoc#config_dbms.logs.user.rotation.keep_number[`dbms.logs.user.rotation.keep_number`]
| `7`
| The maximum number of history files for the _user log_.

| xref:reference/configuration-settings.adoc#config_dbms.logs.user.rotation.size[`dbms.logs.user.rotation.size`]
| `0B`
a|
The threshold size for rotation of the _user log_.
If set to `0` log rotation is disabled.

| xref:reference/configuration-settings.adoc#config_dbms.logs.user.stdout_enabled[`dbms.logs.user.stdout_enabled`]
| `true`
a|
Send user logs to the process stdout.
If this is disabled then logs will instead be sent to the _user log_ (_neo4j.log_).
|===


[[debug-log-file-configuration]]
== Debug log

._Debug log_ configurations
[cols="3", options="header"]
|===
| The _debug log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.debug.level[`dbms.logs.debug.level`]
| `INFO`
| Log level threshold for the _debug log_.

| xref:reference/configuration-settings.adoc#config_dbms.logs.debug.rotation.delay[`dbms.logs.debug.rotation.delay`]
| `5m`
| The minimum time interval after last rotation of the _debug log_, before it may be rotated again.

| xref:reference/configuration-settings.adoc#config_dbms.logs.debug.rotation.keep_number[`dbms.logs.debug.rotation.keep_number`]
| `7`
| The maximum number of history files for the _debug log_.

| xref:reference/configuration-settings.adoc#config_dbms.logs.debug.rotation.size[`dbms.logs.debug.rotation.size`]
| `20M`
| The threshold size for rotation of the _debug log_.
|===


The following table lists all message types raised by Neo4j and their severity level:

.Message types
[cols="3", options="header"]
|===
| Message type
| Severity level
| Description

| `INFO`
| Low severity
| Report status information and errors that are not severe.

| `DEBUG`
| Low severity
| Report details on the raised errors and possible solutions.

| `WARN`
| Low severity
| Report errors that need attention but are not severe.

| `ERROR`
| High severity
| Report errors that prevent the Neo4j server from running and must be addressed immediately.
|===

To set the log level threshold for the _debug log_ use the configuration setting xref:reference/configuration-settings.adoc#config_dbms.logs.debug.level[`dbms.logs.debug.level`].


[[garbage-collection-log-file-configuration]]
== Garbage collection log

._Garbage collection log_ configurations
[cols="3", options="header"]
|===
| The _garbage collection log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.gc.enabled[`dbms.logs.gc.enabled`]
| `false`
| Enable garbage collection logging.

| xref:reference/configuration-settings.adoc#config_dbms.logs.gc.options[`dbms.logs.gc.options`]
|
| Garbage collection logging options.

| xref:reference/configuration-settings.adoc#config_dbms.logs.gc.rotation.keep_number[`dbms.logs.gc.rotation.keep_number`]
| `0`
| The maximum number of history files for the garbage collection log.

| xref:reference/configuration-settings.adoc#config_dbms.logs.gc.rotation.size[`dbms.logs.gc.rotation.size`]
|
| The threshold size for rotation of the garbage collection log.
|===


[[general-logging-http-request-log-file-configuration]]
== HTTP log

._HTTP log_ configurations
[cols="3", options="header"]
|===
| The _HTTP log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.http.enabled[`dbms.logs.http.enabled`]
| `false`
| Enable HTTP logging.

| xref:reference/configuration-settings.adoc#config_dbms.logs.http.rotation.keep_number[`dbms.logs.http.rotation.keep_number`]
| `5`
| The maximum number of history files for the _HTTP log_.

| xref:reference/configuration-settings.adoc#config_dbms.logs.http.rotation.size[`dbms.logs.http.rotation.size`]
| `20M`
| The threshold size for rotation of the _HTTP log_.
|===


[role=enterprise-edition]
[[security-events-logging]]
== Security log

Neo4j provides security event logging that records all security events.

For native user management, the following actions are recorded:

* Login attempts - per default both successful and unsuccessful logins are recorded.
* All xref:authentication-authorization/access-control.adoc#auth-access-control-security[administration commands] run towards the system database.
* All xref:deprecated-security-procedures/enterprise-edition.adoc[security procedures] run towards the system database.

[[secutiry-log-config]]
=== Security log configuration

Rotation of the security events log can be configured in the _neo4j.conf_ configuration file.

The following configuration settings are available for the _security log_:

._Security log_ configurations
[cols="3", options="header"]
|===
| The _security log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.level[`dbms.logs.security.level`]
| `INFO`
| Security log level threshold.

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.path[`dbms.logs.security.path`]
| `security.log`
| The name of the _security log_ file.

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.rotation.size[`dbms.logs.security.rotation.size`]
| `20M`
| Sets the file size at which the security event log will auto-rotate.

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.rotation.delay[`dbms.logs.security.rotation.delay`]
| `300s`
| The minimum time interval after the last _security log_ rotation occurred, before the _security log_ may be rotated again.

| xref:reference/configuration-settings.adoc#config_dbms.logs.security.rotation.keep_number[`dbms.logs.security.rotation.keep_number`]
| `7`
| The number of historical log files kept.
|===

If using LDAP as the authentication method, some cases of LDAP misconfiguration will also be logged, as well as LDAP server communication events and failures.

If many programmatic interactions are expected, it is advised to disable the logging of successful logins.
Logging of successful logins is disabled by setting the xref:reference/configuration-settings.adoc#config_dbms.security.log_successful_authentication[`dbms.security.log_successful_authentication`] parameter in the `neo4j.conf` file:

[source, properties, role="noheader"]
----
dbms.security.log_successful_authentication=false
----

Example output for a security log:

[source, plain format, role="noheader"]
----
2019-12-09 13:45:00.796+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: logged in
2019-12-09 13:47:53.443+0000 ERROR [AsyncLog @ 2019-12-09 ...]  [johndoe]: failed to log in: invalid principal or credentials
2019-12-09 13:48:28.566+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: CREATE USER janedoe SET PASSWORD '******' CHANGE REQUIRED
2019-12-09 13:48:32.753+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: CREATE ROLE custom
2019-12-09 13:49:11.880+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: GRANT ROLE custom TO janedoe
2019-12-09 13:49:34.979+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: GRANT TRAVERSE ON GRAPH * NODES A, B (*) TO custom
2019-12-09 13:49:37.053+0000 INFO  [AsyncLog @ 2019-12-09 ...]  [johnsmith]: DROP USER janedoe
----


[role=enterprise-edition]
[[query-logging]]
== Query log

Neo4j can be configured to log queries executed in the database.

Query logging is enabled by default and is controlled by the setting xref:reference/configuration-settings.adoc#config_dbms.logs.query.enabled[`dbms.logs.query.enabled`].

Configuration options are:

._Query log_ enabled setting
[cols="2", options="header"]
|===
| Option
| Description

| `OFF`
| Will completely disable logging.

| `INFO`
a|
Will log at the end of queries that have either succeeded or failed.
The xref:reference/configuration-settings.adoc#config_dbms.logs.query.threshold[`dbms.logs.query.threshold`] parameter is used to determine the threshold for logging a query.
If the execution of a query takes a longer time than this threshold, it will be logged.
Setting the threshold to `0s` will result in all queries being logged.

| `VERBOSE`
a| Will log all queries at both start and finish, regardless of xref:reference/configuration-settings.adoc#config_dbms.logs.query.threshold[`dbms.logs.query.threshold`]. label:Default[]
|===

[[query-log-config]]
=== Query log configuration

The name of the query log file is `query.log` by default, (see xref:reference/configuration-settings.adoc#config_dbms.logs.query.path[`dbms.logs.query.path`]).

Rotation of the query log can be configured in the _neo4j.conf_ configuration file.

The following configuration settings are available for the query log file:

._Query log_ configurations
[cols="3", options="header"]
|===
| The _query log_ configuration
| Default value
| Description

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.allocation_logging_enabled[`dbms.logs.query.allocation_logging_enabled`]`
| `true`
a| Log allocated bytes for the executed queries being logged.
The logged number is cumulative over the duration of the query, i.e. for memory intense or long-running queries the value may be larger than the current memory allocation.
Requires xref:reference/configuration-settings.adoc#config_dbms.track_query_allocation[`dbms.track_query_allocation=true`].

//New in 4.1
| xref:reference/configuration-settings.adoc#config_dbms.logs.query.early_raw_logging_enabled[`dbms.logs.query.early_raw_logging_enabled`]
| `false`
a|
Log query text and parameters without obfuscating passwords.
This allows queries to be logged earlier before parsing starts.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.enabled[`dbms.logs.query.enabled`]
| `VERBOSE`
| Log executed queries.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.page_logging_enabled[`dbms.logs.query.page_logging_enabled`]
| `false`
| Log page hits and page faults for the executed queries being logged.

//New in 4.1
| xref:reference/configuration-settings.adoc#config_dbms.logs.query.parameter_full_entities[`dbms.logs.query.parameter_full_entities`]
| `false`
a|
Log complete parameter entities including ID, labels or relationship type, and properties.
If `false`, only the entity ID will be logged.
This only takes effect if xref:reference/configuration-settings.adoc#config_dbms.logs.query.parameter_logging_enabled[`dbms.logs.query.parameter_logging_enabled=true`].

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.parameter_logging_enabled[`dbms.logs.query.parameter_logging_enabled`]
| `true`
| Log parameters for the executed queries being logged.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.rotation.keep_number[`dbms.logs.query.rotation.keep_number`]
| `7`
| The maximum number of history files for the _query log_.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.rotation.size[`dbms.logs.query.rotation.size`]
| `20M`
| The file size in bytes at which the _query log_ will auto-rotate.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.runtime_logging_enabled[`dbms.logs.query.runtime_logging_enabled`]
| `true`
| Logs which runtime that was used to run the query.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.threshold[`dbms.logs.query.threshold`]
| `0s`
a|
If the execution of query takes a longer time than this threshold, the query is logged once completed (provided query logging is set to `INFO`).
A threshold of 0 seconds, will log all queries.

| xref:reference/configuration-settings.adoc#config_dbms.logs.query.time_logging_enabled[`dbms.logs.query.time_logging_enabled`]
| `false`
a|
Log detailed time information for the executed queries being logged.
Requires xref:reference/configuration-settings.adoc#config_dbms.track_query_cpu_time[`dbms.track_query_cpu_time=true`].
|===

.Configure for simple query logging
====
In this example we set query logging to `INFO`, but leave all other query log parameters at their defaults.

[source, properties, role="noheader"]
----
dbms.logs.query.enabled=INFO
----

Below is an example of the query log with this basic configuration:

[source, plain format, role="noheader"]
----
2017-11-22 14:31 ... INFO  9 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1		client/127.0.0.1:59167	...
2017-11-22 14:31 ... INFO  0 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1		client/127.0.0.1:59167	...
2017-11-22 14:32 ... INFO  3 ms: server-session	http	127.0.0.1	/db/data/cypher	neo4j - CALL dbms.procedures() - {}
2017-11-22 14:32 ... INFO  1 ms: server-session	http	127.0.0.1	/db/data/cypher	neo4j - CALL dbms.showCurrentUs...
2017-11-22 14:32 ... INFO  0 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1		client/127.0.0.1:59167	...
2017-11-22 14:32 ... INFO  0 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1		client/127.0.0.1:59167	...
2017-11-22 14:32 ... INFO  2 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1		client/127.0.0.1:59261	...
----
====

.Configure for query logging with more details
====
In this example we turn query logging on, and also enable some additional logging.

[source, properties, role="noheader"]
----
dbms.logs.query.parameter_logging_enabled=true
dbms.logs.query.time_logging_enabled=true
dbms.logs.query.allocation_logging_enabled=true
dbms.logs.query.page_logging_enabled=true
----

Below is an example of the query log with these configuration parameters enabled:

[source, plain format, role="noheader"]
----
2017-11-22 12:38 ... INFO  3 ms: bolt-session	bolt	johndoe	neo4j-javascript/1.4.1                         ...
2017-11-22 22:38 ... INFO  61 ms: (planning: 0, cpu: 58, waiting: 0) - 6164496 B - 0 page hits, 1 page faults  ...
2017-11-22 12:38 ... INFO  78 ms: (planning: 40, cpu: 74, waiting: 0) - 6347592 B - 0 page hits, 0 page faults ...
2017-11-22 12:38 ... INFO  44 ms: (planning: 9, cpu: 25, waiting: 0) - 1311384 B - 0 page hits, 0 page faults  ...
2017-11-22 12:38 ... INFO  6 ms: (planning: 2, cpu: 6, waiting: 0) - 420872 B - 0 page hits, 0 page faults -   ...
----
====

[[attach-metadata-tx]]
=== Attach metadata to a transaction

You can attach metadata to a transaction and have it printed in the query log, using the built-in procedure xref:reference/procedures.adoc#procedure_tx_setmetadata[`tx.setMetaData`].

[NOTE]
====
Neo4j Drivers also support attaching metadata to a transaction.
For more information, see the respective Driver's manual.
====

Every graph-app should follow a convention for passing metadata with the queries that it sends to Neo4j:

[source, role=noheader]
----
{
  app: "neo4j-browser_v4.1.11", #<1>
  type: "system" #<2>
}
----
<1> `app` could be a user-agent styled name plus version.
<2> `type` could be one of:
* `system` -- a query automatically run by the app.
* `user-direct` -- a query the user directly submitted to/through the app.
* `user-action` -- a query resulting from an action the user performed.
* `user-transpiled` -- a query that has been derived from the user input.

This is typically done programmatically but can also be used with the Neo4j dev tools. +
In general, you start a transaction on a user database and attach a list of metadata to it by calling `tx.setMetaData`.
You can also use the procedure xref:reference/procedures.adoc#procedure_tx_getmetadata[`CALL tx.getMetaData()`] to show the metadata of the current transaction.
These examples use the MovieGraph dataset from the link:https://neo4j.com/docs/browser-manual/current/visual-tour/#guides[Neo4j Browser guide].

.Using `cypher-shell`, attach metadata to a transaction
====
[source, shell, role=noplay,nocopy]
----
neo4j@neo4j> :begin
neo4j@neo4j# CALL tx.setMetaData({app: 'neo4j-cypher-shell_v.4.1.11', type: 'user-direct', user: 'jsmith'});
0 rows
ready to start consuming query after 2 ms, results consumed after another 0 ms
neo4j@neo4j# CALL tx.getMetaData();
+--------------------------------------------------------------------------+
| metadata                                                                 |
+--------------------------------------------------------------------------+
| {app: "neo4j-cypher-shell_v.4.1.11", type: "user-direct", user: "jsmith"} |
+--------------------------------------------------------------------------+

1 row
ready to start consuming query after 37 ms, results consumed after another 2 ms
neo4j@neo4j# MATCH (n:Person) RETURN n  LIMIT 5;
+----------------------------------------------------+
| n                                                  |
+----------------------------------------------------+
| (:Person {name: "Keanu Reeves", born: 1964})       |
| (:Person {name: "Carrie-Anne Moss", born: 1967})   |
| (:Person {name: "Laurence Fishburne", born: 1961}) |
| (:Person {name: "Hugo Weaving", born: 1960})       |
| (:Person {name: "Lilly Wachowski", born: 1967})    |
+----------------------------------------------------+

5 rows
ready to start consuming query after 2 ms, results consumed after another 1 ms
neo4j@neo4j# :commit
----

.Example result in the _query.log_ file
[source, query log, role="noheader"]
----
2021-07-30 14:43:17.176+0000 INFO  id:225 - 2 ms: 136 B - bolt-session	bolt	neo4j-cypher-shell/v4.1.11		client/127.0.0.1:54026	server/127.0.0.1:7687>	neo4j - neo4j -
MATCH (n:Person) RETURN n  LIMIT 5; - {} - runtime=pipelined - {app: 'neo4j-cypher-shell_v.4.1.11', type: 'user-direct', user: 'jsmith'}
----
====


.Using Neo4j Browser, attach metadata to a transaction
====
[source, cypher]
----
CALL tx.setMetaData({app: 'neo4j-browser_v.4.1.11', type: 'user-direct', user: 'jsmith'});
MATCH (n:Person) RETURN n LIMIT 5
----

.Example result in the _query.log_ file
[source, query log, role="noheader"]
----
2021-07-30 14:51:39.457+0000 INFO  Query started: id:328 - 0 ms: 0 B - bolt-session	bolt	neo4j-browser/v4.1.11		client/127.0.0.1:53666	server/127.0.0.1:7687>	neo4j - neo4j - MATCH (n:Person) RETURN n  LIMIT 5 - {} - runtime=null - {type: 'system', app: 'neo4j-browser_v4.1.11'}
----
====

.Using Neo4j Bloom, attach metadata to a transaction
====
[source, cypher, role="noplay"]
----
CALL tx.setMetaData({app: 'neo4j-browser_v.1.7.0', type: 'user-direct', user: 'jsmith'})
MATCH (n:Person) RETURN n LIMIT 5
----

.Example result in the _query.log_ file
[source, query log, role="noheader"]
----
2021-07-30 15:09:54.048+0000 INFO  id:95 - 1 ms: 72 B - bolt-session	bolt	neo4j-bloom/v1.7.0		client/127.0.0.1:54693	server/127.0.0.1:11003>	neo4j - neo4j - RETURN TRUE - {} - runtime=pipelined - {app: 'neo4j-bloom_v1.7.0', type: 'system'}
----
====

[NOTE]
====
In Neo4j Browser and Bloom, the user-provided metadata is always replaced by the system metadata.
====
