:description: Describes Neo4j Cypher Shell command-line interface (CLI) and how to use it.
[[cypher-shell]]
= Cypher Shell

[[cypher-shell-about]]
== About Cypher Shell CLI

Cypher Shell is a command-line tool that comes with the Neo4j distribution.
It can also be downloaded from link:https://neo4j.com/deployment-center/[Neo4j Deployment Center] and installed separately.

Cypher Shell CLI is used to run queries and perform administrative tasks against a Neo4j instance.
By default, the shell is interactive, but you can also use it for scripting, by passing cypher directly on the command line or by piping a file with cypher statements (requires
PowerShell on Windows).
It communicates via the Bolt protocol.


[[cypher-shell-syntax]]
== Syntax

The Cypher Shell CLI is located in the `bin` directory if installed as part of the product.

*Syntax:*

----
cypher-shell  [-h, --help]
              [-a ADDRESS, --address ADDRESS]
              [-u USERNAME, --username USERNAME]
              [-p PASSWORD, --password PASSWORD]
              [--encryption {true,false,default}]
              [-d DATABASE, --database DATABASE]
              [--format {auto,verbose,plain}]
              [-P PARAM, --param PARAM]
              [--debug]
              [--non-interactive]
              [--sample-rows SAMPLE-ROWS]
              [--wrap {true,false}]
              [-v, --version]
              [--driver-version]
              [-f FILE, --file FILE]
              [--change-password]
              [--fail-fast]
              [--fail-at-end]
              [cypher]
----

*Arguments:*

[cols="4", options="header", cols="25m,15a,30a,30a"]
|===
| Argument
| Type
| Description
| Default value

| -h

--help
| Optional argument
| Show help message and exit.
|

| -a ADDRESS

--address ADDRESS
| Connection argument
| Address and port to connect to.
| `neo4j://localhost:7687`

| -u USERNAME

--username USERNAME
| Connection argument
| Username to connect as.
It can also be specified by the environment variable `NEO4J_USERNAME`.
|

| -p PASSWORD

--password PASSWORD
| Connection argument
| Password to connect with.
It can also be specified by the environment variable `NEO4J_PASSWORD`.
|

| --encryption {true,false,default}
| Connection argument
| Whether the connection to Neo4j should be encrypted; must be consistent with Neo4j's configuration.
| `default`

The encryption setting is deduced from the specified address.
For example, the `neo4j+ssc` protocol would use encryption.


| -d DATABASE

--database DATABASE
| Connection argument
| Database to connect to.
It can also be specified by the environment variable `NEO4J_DATABASE`.
|

| --format {auto,verbose,plain}
| Optional argument
| Desired output format.
|`auto` (default): displays results in tabular format if you use the shell interactively and with minimal formatting if you use it for scripting.

`verbose`: displays results in tabular format and prints statistics.

`plain`: displays data with minimal formatting.

| --P PARAM

--param PARAM
| Optional argument
| Add a parameter to this session.
For example, `-P "number => 3"` or `-P "country => 'Spain'"`.
This argument can be specified multiple times.
|

| --debug
| Optional argument
| Print additional debug information.
| `false`

| --non-interactive
| Optional argument
| Force non-interactive mode; only useful if auto-detection fails (e.g. Windows).
| `false`

| --sample-rows SAMPLE-ROWS
| Optional argument
| Number of rows sampled to compute table widths (only for format=`VERBOSE`).
| `1000`

| --wrap {true,false}
| Optional argument
| Wrap table column values if column is too narrow (only for format=`VERBOSE`).
| `true`

| -v

--version
| Optional argument
| Print version of cypher-shell and exit.
| `false`

| --driver-version
| Optional argument
| Print version of the Neo4j Driver used and exit.
| `false`

| -f FILE

--file FILE
| Optional argument
| Pass a file with cypher statements to be executed.
After the statements have been executed cypher-shell shuts down.
|

| --change-password
| Optional argument
| Change Neo4j user password and exit
| `false`

| --fail-fast
| Optional argument
| Exit and report failure on first error when reading from file.
| This is the default behavior.

| --fail-at-end
| Optional argument
| Exit and report failures at end of input when reading from file.
|

| cypher
| Positional argument
| An optional string of cypher to execute and then exit.
|
|===

[[cypher-shell-run]]
== Running Cypher Shell within the Neo4j distribution

You can connect to a live Neo4j DBMS by running `cypher-shell` and passing in a username and a password argument:

[source, shell]
----
bin/cypher-shell -u neo4j -p <password>
----

The output is the following:

[queryresult]
----
Connected to Neo4j at neo4j://localhost:7687 as user neo4j.
Type :help for a list of available commands or :exit to exit the shell.
Note that Cypher queries must end with a semicolon.
----

[[cypher-shell-standalone]]
== Running Cypher Shell from a different server

You can also install the Cypher Shell tool on a different server (without Neo4j) and connect to a Neo4j DBMS.
Cypher Shell requires a JDK and Java 11.

[NOTE]
====
DEB/RPM distributions both install OpenJDK if it is not already installed.
The _cypher-shell_ files are available in the same DEB/RPM Linux repositories as Neo4j.

The TAR distribution contains only the _cypher-shell_ files, so you must install the JDK manually.
====

. Download Cypher Shell from link:https://neo4j.com/deployment-center/[Neo4j Deployment Center].
. Connect to a Neo4j DBMS by running the `cypher-shell` command providing the Neo4j address, a username, and a password:
+
[source, shell]
----
cypher-shell/cypher-shell -a neo4j://IP-address:7687 -u neo4j -p <password>
----
+
The output is the following:
+
[queryresult]
----
Connected to Neo4j at neo4j://IP-address:7687 as user neo4j.
Type :help for a list of available commands or :exit to exit the shell.
Note that Cypher queries must end with a semicolon.
----

[[cypher-shell-commands]]
== Available commands

Once in the interactive shell, run the following command to display all available commands:

.Running `help`
====

[source, shell]
----
:help
----

The output is the following:

[queryresult]
----
Available commands:
  :begin      Open a transaction
  :commit     Commit the currently open transaction
  :connect    Connects to a database
  :disconnect Disconnects from database
  :exit       Exit the logger
  :help       Show this help message
  :history    Print a list of the last commands executed
  :param      Set the value of a query parameter
  :params     Print all currently set query parameters and their values
  :rollback   Rollback the currently open transaction
  :source     Interactively executes cypher statements from a file
  :use        Set the active database

For help on a specific command type:
  :help command
----
====

[[cypher-shell-statements]]
== Running Cypher statements

You can run Cypher statements in the following ways:

* Typing Cypher statements directly into the interactive shell.
* Running Cypher statements from a file with the interactive shell.
* Running Cypher statements from a file as a `cypher-shell` argument.

The examples in this section use the `MATCH (n) RETURN n LIMIT 5` Cypher statement and will return 5 nodes from the database.

.Typing a Cypher statement directly into the interactive shell
====

[source, shell]
----
MATCH (n) RETURN n LIMIT 5;
----
====

[NOTE]
====
The following two examples assume a file exists in the same folder you run the `cypher-shell` command from called `example.cypher` with the following contents:

[source, cypher, role=noplay]
----
MATCH (n) RETURN n LIMIT 5;
----
====

.Running Cypher statements from a file with the interactive shell
====

You can use the `:source` command followed by the file name to run the Cypher statements in that file when in the Cypher interactive shell:

[source, shell]
----
:source /path/to/your/example.cypher
----
====

.Running Cypher statements from a file as a `cypher-shell` argument.
====

You can pass a file containing Cypher statements as an argument when running `cypher-shell`.

The examples here use the `--format plain` flag for a simple output.

*Using `cat` (UNIX)*

[source, shell]
----
cat example.cypher | bin/cypher-shell -u neo4j -p <password> --format plain
----

*Using `type` (Windows)*

[source, shell]
----
type example.cypher | bin/cypher-shell.bat -u neo4j -p <password> --format plain
----
====

[[cypher-shell-parameters]]
== Query parameters

Cypher Shell CLI supports querying based on parameters.
This is often used while scripting.

.Use parameters within Cypher Shell
====

. Set the parameter `thisAlias` to `Robin` using the `:param` keyword:
+
[source, shell]
----
:param thisAlias => 'Robin'
----
. Check the parameter using the `:params` keyword:
+
[source, shell]
----
:params
----
+
[queryresult]
----
:param thisAlias => 'Robin'
----
+
. Now use the parameter `thisAlias` in a Cypher query:
+
[source, shell]
----
CREATE (:Person {name : 'Dick Grayson', alias : $thisAlias });
----
+
[queryresult]
----
Added 1 nodes, Set 2 properties, Added 1 labels
----
+
. Verify the result:
+
[queryresult]
----
MATCH (n) RETURN n;
----
+
[queryresult]
----
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms
----
====

[[cypher-shell-transactions]]
== Transactions

Cypher Shell supports explicit transactions.
Transaction states are controlled using the keywords `:begin`, `:commit`, and `:rollback`.

.Use fine-grained transaction control
====
The example uses the dataset from the built-in Neo4j Browser guide, called MovieGraph.
For more information, see the link:https://neo4j.com/docs/browser-manual/current/visual-tour/#guides[Neo4j Browser documentation].

. Run a query that shows there is only one person in the database, who is born in 1964.
+
[source, shell]
----
MATCH (n:Person) WHERE n.born=1964 RETURN n.name AS name;
----
+
[queryresult]
----
+----------------+
| name           |
+----------------+
| "Keanu Reeves" |
+----------------+

1 row
ready to start consuming query after 9 ms, results consumed after another 0 ms
----
+
. Start a transaction and create another person born in the same year:
+
[source, shell]
----
:begin
neo4j# CREATE (:Person {name : 'Edward Mygma', born:1964});
----
+
[queryresult]
----
0 rows
ready to start consuming query after 38 ms, results consumed after another 0 ms
Added 1 nodes, Set 2 properties, Added 1 labels
----
+
. If you open a second Cypher Shell session and run the query from step 1, you will notice no changes from the latest `CREATE` statement.
+
[source, shell]
----
MATCH (n:Person) WHERE n.born=1964 RETURN n.name AS name;
----
+
[queryresult]
----
+----------------+
| name           |
+----------------+
| "Keanu Reeves" |
+----------------+

1 row
ready to start consuming query after 9 ms, results consumed after another 0 ms
----
+
. Go back to the first session and commit the transaction.
+
[source, shell]
----
neo4j# :commit
----
. Now, if you run the query from step 1, you will see that Edward Mygma has been added to the database.
+
[source, shell]
----
MATCH (n:Person) WHERE n.born=1964 RETURN n.name AS name;
----
+
[queryresult]
----
+----------------+
| name           |
+----------------+
| "Keanu Reeves" |
| "Edward Mygma" |
+----------------+

2 rows
ready to start consuming query after 1 ms, results consumed after another 1 ms
----
====

[[cypher-shell-procedures]]
== Procedures

Cypher Shell supports running any procedures for which the current user is authorized.

.Call the `dbms.showCurrentUser` procedure
====

[source, shell]
----
CALL dbms.showCurrentUser();
----

[queryresult]
----
+------------------------------+
| username | roles     | flags |
+------------------------------+
| "neo4j"  | ["admin"] | []    |
+------------------------------+

1 row available after 66 ms, consumed after another 2 ms
----
====


[[cypher-shell-support]]
== Supported operating systems

You can use the Cypher Shell CLI via `cmd` on Windows systems, and `bash` on Unix systems.

Other shells may work as intended, but there is no test coverage to guarantee compatibility.


[[keyboard-shortcuts]]
== Keyboard shortcuts

The following keyboard commands are available in interactive mode.

[cols="1,1"]
|===
|Key |Operation

|Home (key)
|Moves the cursor to the first character in the current line.

|End (key)
|Moves the cursor to the last character in the current line.
|===
